# Springboard Data Science Career Track Unit 4 Challenge - Tier 3 Complete

## Objectives
Hey! Great job getting through those challenging DataCamp courses. You're learning a lot in a short span of time. 

In this notebook, you're going to apply the skills you've been learning, bridging the gap between the controlled environment of DataCamp and the *slightly* messier work that data scientists do with actual datasets!

Here’s the mystery we’re going to solve: ***which boroughs of London have seen the greatest increase in housing prices, on average, over the last two decades?***


A borough is just a fancy word for district. You may be familiar with the five boroughs of New York… well, there are 32 boroughs within Greater London [(here's some info for the curious)](https://en.wikipedia.org/wiki/London_boroughs). Some of them are more desirable areas to live in, and the data will reflect that with a greater rise in housing prices.

***This is the Tier 3 notebook, which means it's not filled in at all: we'll just give you the skeleton of a project, the brief and the data. It's up to you to play around with it and see what you can find out! Good luck! If you struggle, feel free to look at easier tiers for help; but try to dip in and out of them, as the more independent work you do, the better it is for your learning!***

This challenge will make use of only what you learned in the following DataCamp courses: 
- Prework courses (Introduction to Python for Data Science, Intermediate Python for Data Science)
- Data Types for Data Science
- Python Data Science Toolbox (Part One) 
- pandas Foundations
- Manipulating DataFrames with pandas
- Merging DataFrames with pandas

Of the tools, techniques and concepts in the above DataCamp courses, this challenge should require the application of the following: 
- **pandas**
    - **data ingestion and inspection** (pandas Foundations, Module One) 
    - **exploratory data analysis** (pandas Foundations, Module Two)
    - **tidying and cleaning** (Manipulating DataFrames with pandas, Module Three) 
    - **transforming DataFrames** (Manipulating DataFrames with pandas, Module One)
    - **subsetting DataFrames with lists** (Manipulating DataFrames with pandas, Module One) 
    - **filtering DataFrames** (Manipulating DataFrames with pandas, Module One) 
    - **grouping data** (Manipulating DataFrames with pandas, Module Four) 
    - **melting data** (Manipulating DataFrames with pandas, Module Three) 
    - **advanced indexing** (Manipulating DataFrames with pandas, Module Four) 
- **matplotlib** (Intermediate Python for Data Science, Module One)
- **fundamental data types** (Data Types for Data Science, Module One) 
- **dictionaries** (Intermediate Python for Data Science, Module Two)
- **handling dates and times** (Data Types for Data Science, Module Four)
- **function definition** (Python Data Science Toolbox - Part One, Module One)
- **default arguments, variable length, and scope** (Python Data Science Toolbox - Part One, Module Two) 
- **lambda functions and error handling** (Python Data Science Toolbox - Part One, Module Four)

## The Data Science Pipeline

This is Tier Three, so we'll get you started. But after that, it's all in your hands! When you feel done with your investigations, look back over what you've accomplished, and prepare a quick presentation of your findings for the next mentor meeting. 

Data Science is magical. In this case study, you'll get to apply some complex machine learning algorithms. But as  [David Spiegelhalter](https://www.youtube.com/watch?v=oUs1uvsz0Ok) reminds us, there is no substitute for simply **taking a really, really good look at the data.** Sometimes, this is all we need to answer our question.

Data Science projects generally adhere to the four stages of Data Science Pipeline:
1. Sourcing and loading 
2. Cleaning, transforming, and visualizing 
3. Modeling 
4. Evaluating and concluding

### 1. Sourcing and Loading 

Any Data Science project kicks off by importing  ***pandas***. The documentation of this wonderful library can be found [here](https://pandas.pydata.org/). As you've seen, pandas is conveniently connected to the [Numpy](http://www.numpy.org/) and [Matplotlib](https://matplotlib.org/) libraries. 

***Hint:*** This part of the data science pipeline will test those skills you acquired in the pandas Foundations course, Module One.

#### 1.1. Importing Libraries

In [1]:
# Let's import the pandas, numpy libraries as pd, and np respectively. 
import pandas as pd
import numpy as np

# Load the pyplot collection of functions from matplotlib, as plt 
from matplotlib import pyplot as plt

#### 1.2.  Loading the data
Your data comes from the [London Datastore](https://data.london.gov.uk/): a free, open-source data-sharing portal for London-oriented datasets.

In [2]:
# First, make a variable called url_LondonHousePrices, and assign it the following link, enclosed in quotation-marks as a string:
# https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls

url_LondonHousePrices = "https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls"

# The dataset we're interested in contains the Average prices of the houses, and is actually on a particular sheet of the Excel file. 
# As a result, we need to specify the sheet name in the read_excel() method.
# Put this data into a variable called properties.  
properties = pd.read_excel(url_LondonHousePrices, sheet_name='Average price', index_col= None)

### 2. Cleaning, transforming, and visualizing
This second stage is arguably the most important part of any Data Science project. The first thing to do is take a proper look at the data. Cleaning forms the majority of this stage, and can be done both before or after Transformation.

The end goal of data cleaning is to have tidy data. When data is tidy: 

1. Each variable has a column.
2. Each observation forms a row.

Keep the end goal in mind as you move through this process, every step will take you closer. 



***Hint:*** This part of the data science pipeline should test those skills you acquired in: 
- Intermediate Python for data science, all modules.
- pandas Foundations, all modules. 
- Manipulating DataFrames with pandas, all modules.
- Data Types for Data Science, Module Four.
- Python Data Science Toolbox - Part One, all modules

**2.1. Exploring your data** 

Think about your pandas functions for checking out a dataframe.

In [3]:
properties.head()

,Unnamed: 0,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
0,NaT,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,E09000009,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001
1,1995-01-01,91448.98487,50460.2266,93284.51832,64958.09036,71306.56698,81671.47692,120932.8881,69158.16225,79885.89069,...,43958.48001,44803.42878,45544.52227,48527.52339,56701.5961,74435.76052,64018.87894,54705.1579,NaN,53202.77128
2,1995-02-01,82202.77314,51085.77983,93190.16963,64787.92069,72022.26197,81657.55944,119508.8622,68951.09542,80897.06551,...,43925.42289,44528.80721,46051.57066,49341.29029,56593.59475,72777.93709,63715.02399,54356.14843,NaN,53096.1549
3,1995-03-01,79120.70256,51268.96956,92247.52435,64367.49344,72015.76274,81449.31143,120282.2131,68712.44341,81379.86288,...,44434.8681,45200.46775,45383.82395,49442.17973,56171.18278,73896.84204,64113.60858,53583.07667,NaN,53201.2843
4,1995-04-01,77101.20804,53133.50526,90762.87492,64277.66881,72965.63094,81124.41227,120097.899,68610.04641,82188.90498,...,44267.7796,45614.34341,46124.23045,49455.93299,56567.89582,74455.28754,64623.22395,54786.01938,NaN,53590.8548

In [4]:
print('\nshape: \n(rows,cols)')
print(properties.shape)
print(('-'*100),'\ninfo: \n')
print(properties.info())

shape:
(rows,cols)
(346, 49)
----------------------------------------------------------------------------------------------------
info:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 346 entries, 0 to 345
Data columns (total 49 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            345 non-null    datetime64[ns]
 1   City of London        346 non-null    object
 2   Barking & Dagenham    346 non-null    object
 3   Barnet                346 non-null    object
 4   Bexley                346 non-null    object
 5   Brent                 346 non-null    object
 6   Bromley               346 non-null    object
 7   Camden                346 non-null    object
 8   Croydon               346 non-null    object
 9   Ealing                346 non-null    object
 10  Enfield               346 non-null    object
 11  Greenwich             346 non-null    object
 12  Hackney               346 non-null    object
 13  Hammersmith & Fulham  346 non-null    object
 14  Haringey              346 non-null    object
 15  Harrow                346 non-null    object
 16  Havering              346 non-null    object
 17  Hillingdon            346 non-null    object
 18  Hounslow              346 non-null    object
 19  Islington             346 non-null    object
 20  Kensington & Chelsea  346 non-null    object
 21  Kingston upon Thames  346 non-null    object
 22  Lambeth               346 non-null    object
 23  Lewisham              346 non-null    object
 24  Merton                346 non-null    object
 25  Newham                346 non-null    object
 26  Redbridge             346 non-null    object
 27  Richmond upon Thames  346 non-null    object
 28  Southwark             346 non-null    object
 29  Sutton                346 non-null    object
 30  Tower Hamlets         346 non-null    object
 31  Waltham Forest        346 non-null    object
 32  Wandsworth            346 non-null    object
 33  Westminster           346 non-null    object
 34  Unnamed: 34           0 non-null      float64
 35  Inner London          346 non-null    object
 36  Outer London          346 non-null    object
 37  Unnamed: 37           0 non-null      float64
 38  NORTH EAST            346 non-null    object
 39  NORTH WEST            346 non-null    object
 40  YORKS & THE HUMBER    346 non-null    object
 41  EAST MIDLANDS         346 non-null    object
 42  WEST MIDLANDS         346 non-null    object
 43  EAST OF ENGLAND       346 non-null    object
 44  LONDON                346 non-null    object
 45  SOUTH EAST            346 non-null    object
 46  SOUTH WEST            346 non-null    object
 47  Unnamed: 47           0 non-null      float64
 48  England               346 non-null    object
dtypes: datetime64[ns](1), float64(3), object(45)
memory usage: 132.6+ KB
None

In [6]:
properties.describe()
#AP: useless for now, maybe helpful after data cleaning

                Unnamed: 0  Unnamed: 34  Unnamed: 37  Unnamed: 47
count                  345          0.0          0.0          0.0
mean   2009-05-01 16:00:00          NaN          NaN          NaN
min    1995-01-01 00:00:00          NaN          NaN          NaN
25%    2002-03-01 00:00:00          NaN          NaN          NaN
50%    2009-05-01 00:00:00          NaN          NaN          NaN
75%    2016-07-01 00:00:00          NaN          NaN          NaN
max    2023-09-01 00:00:00          NaN          NaN          NaN
std                    NaN          NaN          NaN          NaN

**2.2. Cleaning the data**

You might find you need to transpose your dataframe, check out what its row indexes are, and reset the index. You  also might find you need to assign the values of the first row to your column headings  . (Hint: recall the .columns feature of DataFrames, as well as the iloc[] method).

Don't be afraid to use StackOverflow for help  with this.

In [8]:
#AP: Transpose the properties DF so each borough is a row & reset the index to zero-indexing (originally first col 'index' was set as the index)
#AP: chained multiple methods to condense the code a little.
properties_2_2 = properties.T.reset_index()
print('Transposed shape:\n', properties_2_2.shape)
properties_2_2.head(2) #AP: Three cols b/c 4+ cols output overflows and just easier for me to read/understand w/out overflow

Transposed shape:
 (49, 347)

,index,0,1,2,3,4,5,6,7,8,...,336,337,338,339,340,341,342,343,344,345
0,Unnamed: 0,NaT,1995-01-01 00:00:00,1995-02-01 00:00:00,1995-03-01 00:00:00,1995-04-01 00:00:00,1995-05-01 00:00:00,1995-06-01 00:00:00,1995-07-01 00:00:00,1995-08-01 00:00:00,...,2022-12-01 00:00:00,2023-01-01 00:00:00,2023-02-01 00:00:00,2023-03-01 00:00:00,2023-04-01 00:00:00,2023-05-01 00:00:00,2023-06-01 00:00:00,2023-07-01 00:00:00,2023-08-01 00:00:00,2023-09-01 00:00:00
1,City of London,E09000001,91448.98487,82202.77314,79120.70256,77101.20804,84409.14932,94900.51244,110128.0423,112329.4376,...,975240,963094,869039,930986,903718,958418,951649,931176,861107,807475

In [ ]:
#AP: skip - properties.info gives me enough info to know I only need to worry about the NaT in second col of properties.T, No other null values besides the entire unnamed rows.
#AP: Check how many null values are in row 0 (the row to be set as col names & dropped). Known "NaT" at location [1, 0]. If more than 1 null value, need to find location & determine next steps

#properties_2_2.columns = range(properties_2_2.columns.size)
#print(properties_2_2.columns)
#list_of_col_names = list(properties_2_2.iloc[0]) #So I can check if there's any funky col names
#cnt_missing = properties_2_2.isnull().sum()
#print('-'*100)
#print(cnt_missing)

In [ ]:
#AP: skip - attempt at getting exact location of nulls
#nulls = properties_2_2.isna().values.any(axis=1)
#print(properties_2_2.loc[properties_2_2.isna().any(axis=1)])

In [ ]:
#AP: commented this code out. Figured out how to change col name when original is NaT (pd.NaT). This might be good as a reminder to future me of possible alt way of doing it.
#AP: Set values in row 0 for first & second col's so don't have to fix later
#properties_2_2.iat[0,0] = 'Areas'
#properties_2_2.iat[0,1] = 'GSS_Code'
#properties_2_2.head(2)

In [9]:
#AP: set first row as column names (looks like the dates avg prices reported) & drop row 0 since it's the col names now.
properties_2_2.columns = properties_2_2.iloc[0]
properties_2_2 = properties_2_2.drop(0)
properties_2_2.head(2)

,Unnamed: 0,NaT,1995-01-01 00:00:00,1995-02-01 00:00:00,1995-03-01 00:00:00,1995-04-01 00:00:00,1995-05-01 00:00:00,1995-06-01 00:00:00,1995-07-01 00:00:00,1995-08-01 00:00:00,...,2022-12-01 00:00:00,2023-01-01 00:00:00,2023-02-01 00:00:00,2023-03-01 00:00:00,2023-04-01 00:00:00,2023-05-01 00:00:00,2023-06-01 00:00:00,2023-07-01 00:00:00,2023-08-01 00:00:00,2023-09-01 00:00:00
1,City of London,E09000001,91448.98487,82202.77314,79120.70256,77101.20804,84409.14932,94900.51244,110128.0423,112329.4376,...,975240,963094,869039,930986,903718,958418,951649,931176,861107,807475
2,Barking & Dagenham,E09000002,50460.2266,51085.77983,51268.96956,53133.50526,53042.24852,53700.34831,52113.12157,52232.19868,...,355596,353429,346193,345288,348254,349590,346099,343430,344171,345614

**2.3. Cleaning the data (part 2)**

You might we have to **rename** a couple columns. How do you do this? The clue's pretty bold...

In [10]:
#AP: Rename first & second cols. Note that renaming NaT col need to use pd.NaT (without quotes)
#AP: internet search told me that second col is GSS codes of the boroughs
properties_2_3 = properties_2_2.rename({'Unnamed: 0':'area', pd.NaT:'gss_code'}, axis=1)
properties_2_3.head(2)

,area,gss_code,1995-01-01 00:00:00,1995-02-01 00:00:00,1995-03-01 00:00:00,1995-04-01 00:00:00,1995-05-01 00:00:00,1995-06-01 00:00:00,1995-07-01 00:00:00,1995-08-01 00:00:00,...,2022-12-01 00:00:00,2023-01-01 00:00:00,2023-02-01 00:00:00,2023-03-01 00:00:00,2023-04-01 00:00:00,2023-05-01 00:00:00,2023-06-01 00:00:00,2023-07-01 00:00:00,2023-08-01 00:00:00,2023-09-01 00:00:00
1,City of London,E09000001,91448.98487,82202.77314,79120.70256,77101.20804,84409.14932,94900.51244,110128.0423,112329.4376,...,975240,963094,869039,930986,903718,958418,951649,931176,861107,807475
2,Barking & Dagenham,E09000002,50460.2266,51085.77983,51268.96956,53133.50526,53042.24852,53700.34831,52113.12157,52232.19868,...,355596,353429,346193,345288,348254,349590,346099,343430,344171,345614

**2.4.Transforming the data**

Remember what Wes McKinney said about tidy data? 

You might need to **melt** your DataFrame here.

In [11]:
properties_2_4 = properties_2_3

In [12]:
#Gonna deal with the missing values here, I feel simpler to do now than after melting
#Find what extra areas are in the DF in addition to the 32 boroughs + City of London & make a list of them
#boroughs copied from internet
boroughs_list = ['City of London', 'Camden', 'Greenwich', 'Hackney', 'Hammersmith & Fulham', 'Islington', 'Kensington & Chelsea', 'Lambeth', 'Lewisham', 'Southwark', 'Tower Hamlets', 'Wandsworth', 'Westminster', 'Barking & Dagenham', 'Barnet', 'Bexley', 'Brent', 'Bromley', 'Croydon', 'Ealing', 'Enfield', 'Haringey', 'Harrow', 'Havering', 'Hillingdon', 'Hounslow', 'Kingston upon Thames', 'Merton', 'Newham', 'Redbridge', 'Richmond upon Thames', 'Sutton', 'Waltham Forest']

In [13]:
print('unique areas:\n',properties_2_4['area'].unique())
print('-'*20, '\nunique count:', len(properties_2_4['area'].unique()))
unique_areas = properties_2_4['area'].unique()
print('\nExcess elements of DF columns vs boroughs_list:')
print(np.setdiff1d(list(unique_areas), boroughs_list))
excess_areas = list(np.setdiff1d(list(unique_areas), boroughs_list))
print('Len of boroughs list: ', len(boroughs_list))
print('Len of unique_areas list: ',len(unique_areas))
print('Len of excess list: ',len(excess_areas))
diff_unique_excess = len(unique_areas) - len(excess_areas)
print("Diff in len's: ", diff_unique_excess)
print('Diff = 33?:', 'Yes' if diff_unique_excess == 33 else 'No, check list contents')

unique areas:
 ['City of London' 'Barking & Dagenham' 'Barnet' 'Bexley' 'Brent' 'Bromley'
 'Camden' 'Croydon' 'Ealing' 'Enfield' 'Greenwich' 'Hackney'
 'Hammersmith & Fulham' 'Haringey' 'Harrow' 'Havering' 'Hillingdon'
 'Hounslow' 'Islington' 'Kensington & Chelsea' 'Kingston upon Thames'
 'Lambeth' 'Lewisham' 'Merton' 'Newham' 'Redbridge' 'Richmond upon Thames'
 'Southwark' 'Sutton' 'Tower Hamlets' 'Waltham Forest' 'Wandsworth'
 'Westminster' 'Unnamed: 34' 'Inner London' 'Outer London' 'Unnamed: 37'
 'NORTH EAST' 'NORTH WEST' 'YORKS & THE HUMBER' 'EAST MIDLANDS'
 'WEST MIDLANDS' 'EAST OF ENGLAND' 'LONDON' 'SOUTH EAST' 'SOUTH WEST'
 'Unnamed: 47' 'England']
--------------------
unique count: 48

Excess elements of DF columns vs boroughs_list:
['EAST MIDLANDS' 'EAST OF ENGLAND' 'England' 'Inner London' 'LONDON'
 'NORTH EAST' 'NORTH WEST' 'Outer London' 'SOUTH EAST' 'SOUTH WEST'
 'Unnamed: 34' 'Unnamed: 37' 'Unnamed: 47' 'WEST MIDLANDS'
 'YORKS & THE HUMBER']
Len of boroughs list:  33
Len of unique_areas list:  48
Len of excess list:  15
Diff in len's:  33
Diff = 33?: Yes

In [14]:
#AP: set 'area' col as index so I can drop desired rows, keeping the 'area' col and resetting the index after
#AP: Better way to do this?
properties_2_4.index =properties_2_4['area']
print(properties_2_4.head(1)) #visual check I set index correctly
print(properties_2_4.shape)

0                         area   gss_code 1995-01-01 00:00:00  \
area
City of London  City of London  E09000001         91448.98487

0              1995-02-01 00:00:00 1995-03-01 00:00:00 1995-04-01 00:00:00  \
area
City of London         82202.77314         79120.70256         77101.20804

0              1995-05-01 00:00:00 1995-06-01 00:00:00 1995-07-01 00:00:00  \
area
City of London         84409.14932         94900.51244         110128.0423

0              1995-08-01 00:00:00  ... 2022-12-01 00:00:00  \
area                                ...
City of London         112329.4376  ...              975240

0              2023-01-01 00:00:00 2023-02-01 00:00:00 2023-03-01 00:00:00  \
area
City of London              963094              869039              930986

0              2023-04-01 00:00:00 2023-05-01 00:00:00 2023-06-01 00:00:00  \
area
City of London              903718              958418              951649

0              2023-07-01 00:00:00 2023-08-01 00:00:00 2023-09-01 00:00:00
area
City of London              931176              861107              807475

[1 rows x 347 columns]
(48, 347)

In [17]:
#AP: edited out inplace=True and assigned code to a var
properties_2_4_1 = properties_2_4.drop(index=excess_areas)

In [28]:
#AP: checking out df, making sure I removed correct areas and kept the london boroughs
print('shape: ',properties_2_4_1.shape)
properties_2_4_1.head(2)

shape:  (33, 347)

,area,gss_code,1995-01-01 00:00:00,1995-02-01 00:00:00,1995-03-01 00:00:00,1995-04-01 00:00:00,1995-05-01 00:00:00,1995-06-01 00:00:00,1995-07-01 00:00:00,1995-08-01 00:00:00,...,2022-12-01 00:00:00,2023-01-01 00:00:00,2023-02-01 00:00:00,2023-03-01 00:00:00,2023-04-01 00:00:00,2023-05-01 00:00:00,2023-06-01 00:00:00,2023-07-01 00:00:00,2023-08-01 00:00:00,2023-09-01 00:00:00
area,,,,,,,,,,,,,,,,,,,,,
City of London,City of London,E09000001,91448.98487,82202.77314,79120.70256,77101.20804,84409.14932,94900.51244,110128.0423,112329.4376,...,975240,963094,869039,930986,903718,958418,951649,931176,861107,807475
Barking & Dagenham,Barking & Dagenham,E09000002,50460.2266,51085.77983,51268.96956,53133.50526,53042.24852,53700.34831,52113.12157,52232.19868,...,355596,353429,346193,345288,348254,349590,346099,343430,344171,345614

In [33]:
#AP: Reseting the index to zero-indexing, don't feel need to keep original df intact and drop=True since col already exists
properties_2_4_1.reset_index(inplace=True, drop=True)

In [35]:
#AP: Confirming no nulls
properties_2_4_1.isna().sum()

0
area                   0
gss_code               0
1995-01-01 00:00:00    0
1995-02-01 00:00:00    0
1995-03-01 00:00:00    0
                      ..
2023-05-01 00:00:00    0
2023-06-01 00:00:00    0
2023-07-01 00:00:00    0
2023-08-01 00:00:00    0
2023-09-01 00:00:00    0
Length: 347, dtype: int64

In [38]:
#AP: comparing list of the areas in DF to the boroughs list
prop_areas_list = sorted(list(properties_2_4_1['area']))
if prop_areas_list == sorted(boroughs_list):
    print('match!')
else:
    print('Not match')

match!

In [39]:
#AP: commenting this out, I made more concise code above
#unique_areas2 = list(properties_2_4['area'].unique())
#if sorted(unique_areas2) == sorted(boroughs_list):
#    print('1-to-1 Match, dropped rows correctly')
#elif len(unique_areas2) == len(boroughs_list):
#    print('len match, not 1-to-1')
#else:
#    print('smthn needs fixin')

In [40]:
#Commenting out, reset_index above (and had assigned different var)
#AP: Reset the index to zero-indexing after I drop desired rows
#properties_2_4.reset_index(drop=True, inplace=True)
#properties_2_4.head(2)

In [42]:
#AP: Changed vars from properties_2_3 & properties_2_4 to properties_2_4_1 & properties_2_4_2, resepectively
#AP:Note to self: purpose of melting DF (in this case at least) is to reduce # of cols and so each row is truly a SINGLE observation
properties_2_4_2 = properties_2_4_1.melt(id_vars=['area', 'gss_code'], var_name='date', value_name='avg_price')
properties_2_4_2

                     area   gss_code       date    avg_price
0          City of London  E09000001 1995-01-01  91448.98487
1      Barking & Dagenham  E09000002 1995-01-01   50460.2266
2                  Barnet  E09000003 1995-01-01  93284.51832
3                  Bexley  E09000004 1995-01-01  64958.09036
4                   Brent  E09000005 1995-01-01  71306.56698
...                   ...        ...        ...          ...
11380              Sutton  E09000029 2023-09-01       437958
11381       Tower Hamlets  E09000030 2023-09-01       509454
11382      Waltham Forest  E09000031 2023-09-01       510471
11383          Wandsworth  E09000032 2023-09-01       637929
11384         Westminster  E09000033 2023-09-01       967277

[11385 rows x 4 columns]

Remember to make sure your column data types are all correct. Average prices, for example, should be floating point numbers...

In [43]:
properties_2_4.dtypes

area                 object
gss_code             object
date         datetime64[ns]
avg_price            object
dtype: object

In [47]:
#AP: Note to self, alt way is to use pd.to_numeric(...)
#AP: Changed properties_2_4 & properties_2_4_1 to properties_2_4_2, don't feel need to assign new var for changing dtype
properties_2_4_2 = properties_2_4_2.astype(dtype= {'avg_price': float})

In [48]:
#changed properties_2_4_1 to properties_2_4_2
properties_2_4_2.dtypes

area                 object
gss_code             object
date         datetime64[ns]
avg_price           float64
dtype: object

**2.5. Cleaning the data (part 3)**

Do we have an equal number of observations in the ID, Average Price, Month, and London Borough columns? Remember that there are only 32 London Boroughs. How many entries do you have in that column? 

Check out the contents of the London Borough column, and if you find null values, get rid of them however you see fit.

In [ ]:
properties_2_5 = properties_2_4_1

In [ ]:
#how many null values in each col
print('nulls:\n',properties_2_5.isna().sum())
print('-'*20,'\nnon-null counts:\n', properties_2_5.count())

In [ ]:
#Dropped rows of non-borough areas and rows of 100% missing data before melting in step 2.4

#drop the excess areas from properties_2_5 DF
#properties_2_5_1 = properties_2_5[properties_2_5['area'].isin(excess_areas) == True]
#print('excess_areas list:\n',excess_areas,'\n')
#print(list(properties_2_5_1['area'].unique()))
#list( properties_2_5_1['area'].unique()) == excess_areas
#print('null count:\n', properties_2_5.isna().sum())

**2.6. Visualizing the data**

To visualize the data, why not subset on a particular London Borough? Maybe do a line plot of Month against Average Price?

In [ ]:
properties_2_6 = properties_2_5

In [ ]:
#checking for null's since I've been getting errors
properties_2_6.isna().sum()

In [ ]:
import random as rand

In [ ]:
rand_borough = str(rand.choice(boroughs_list))
print(f"\nBorough: {rand_borough}\n")
properties_2_6_plot = properties_2_6[properties_2_6['area'] == f'{rand_borough}'].plot(kind='line', x='date', y='avg_price')

To limit the number of data points you have, you might want to extract the year from every month value your *Month* column. 

To this end, you *could* apply a ***lambda function***. Your logic could work as follows:
1. look through the `Month` column
2. extract the year from each individual value in that column 
3. store that corresponding year as separate column. 

Whether you go ahead with this is up to you. Just so long as you answer our initial brief: which boroughs of London have seen the greatest house price increase, on average, over the past two decades?

In [ ]:
properties_2_6

In [ ]:
properties_2_6['year'] = properties_2_6['date'].apply(lambda t: t.year)
print(properties_2_6.isna().sum())
properties_2_6.tail(20)

In [ ]:
properties_2_6_grp = properties_2_6.groupby(by=['area', 'year']).mean(numeric_only=True)
properties_2_6_grp.head()

In [ ]:
properties_2_6_grp.reset_index(inplace=True)

In [ ]:
properties_2_6_grp

In [ ]:
#Can't figure out how to split boroughs apart in plot
properties_2_6_plot2 = properties_2_6_grp.plot(kind='line', x='year', y='avg_price')

**3. Modeling**

Consider creating a function that will calculate a ratio of house prices, comparing the price of a house in 2018 to the price in 1998.

Consider calling this function create_price_ratio.

You'd want this function to:
1. Take a filter of dfg, specifically where this filter constrains the London_Borough, as an argument. For example, one admissible argument should be: dfg[dfg['London_Borough']=='Camden'].
2. Get the Average Price for that Borough, for the years 1998 and 2018.
4. Calculate the ratio of the Average Price for 1998 divided by the Average Price for 2018.
5. Return that ratio.

Once you've written this function, you ultimately want to use it to iterate through all the unique London_Boroughs and work out the ratio capturing the difference of house prices between 1998 and 2018.

Bear in mind: you don't have to write a function like this if you don't want to. If you can solve the brief otherwise, then great! 

***Hint***: This section should test the skills you acquired in:
- Python Data Science Toolbox - Part One, all modules

In [ ]:
properties_3 = properties_2_6_grp

In [ ]:
properties_3.head(2)

In [ ]:
properties_3_indx = properties_3.set_index('area')

In [ ]:
properties_3_indx.head(2)

In [ ]:
def create_price_ratio (Borough):
    """Create a price ratio of average London Borough house price betweeen 1998 & 2018"""
    filt_borough = properties_3_indx.loc[Borough]
    filt_1998 = filt_borough[filt_borough['year'] == 1998]
    filt_2018 = filt_borough[filt_borough['year'] == 2018]
    price_1998 = filt_1998.at[f"{Borough}", 'avg_price']
    price_2018 = filt_2018.at[f"{Borough}", 'avg_price']
    return f"{(price_1998/price_2018):.2%}%"

In [ ]:
#Note to self: Why append to list not working??? I want to order from largest to smallest
print("Price increase % for each London Borough between 1998 & 2018")
change_dict = {}
for place in boroughs_list:
    change_dict[place] = create_price_ratio(place)
print(change_dict)

In [ ]:
change_df = pd.DataFrame.from_dict(change_dict, orient='index', columns=['%_change'])
change_df.sort_values('%_change', ascending=False)

In [ ]:
change_df_bar = change_df.reset_index()
change_df_bar.head(2)

In [ ]:
change_df_bar.rename(columns={'index':'Borough'}, inplace=True)
change_df_bar.sample(2)

In [ ]:
change_df_bar.dtypes

In [ ]:
plt.plot(kind='bar', data=change_dict)

### 4. Conclusion
What can you conclude? Type out your conclusion below. 
## I can conclude that housing prices in London need to calm down. Hackney has the lowest rate of price increase, Hounslow has the highest price increase rate. In the end it woould be easier to group boroughs by ranges of price increase, choose the range you're most comfortable with then compare boroughs using other factors to decide where to live.

Look back at your notebook. Think about how you might summarize what you have done, and prepare a quick presentation on it to your mentor at your next meeting. 

We hope you enjoyed this practical project. It should have consolidated your data hygiene and pandas skills by looking at a real-world problem involving just the kind of dataset you might encounter as a budding data scientist. Congratulations, and looking forward to seeing you at the next step in the course!